/*
А) Перед main() в комментариях ответьте на вопросы и напишите соответствия С – С++ для
следующих функций(причем соответствия необязательно будут в виде функций) :
	1) strlen - …
	2) strcpy - …
	3) strcmp - …
	4) strcat - …
	5) someString[index] - …(getting the character at index)
	6) … - push_back
	7) … - pop_back
	Функции могут не иметь точного аналога в библиотеке другого языка.Почему ? – объясните главную
	разницу строк в С и С++.

	Б) Теперь напишите программу на С++, которая будет сортировать буквы в алфавитном порядке в
	веденной пользователем строке.Причем программа должна удалять пробелы и пунктуационные
	знаки.
	NB: Используйте только библиотеку <string>.
*/	
#include "taskOne.h"
#include <iostream>

void taskOne() {
	std::cout << "upr1\n";
}